In [120]:
import pandas as pd

In [121]:
ws_df = pd.read_csv("../../data/raw/web_session.csv")
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop
1,11000000001,332.0,2025-07-26 11:49:20,2025-07-26 11:57:20,direct,desktop
2,11000000002,NaN,2024-06-04 03:04:56,2024-06-04 03:06:56,email,mobile
3,11000000003,771.0,2024-03-24 15:50:13,2024-03-24 16:30:13,ads,mobile
4,11000000004,908.0,2024-08-22 16:47:04,2024-08-22 17:00:04,direct,mobile

In [122]:
ws_df.isnull().sum()

session_id         0
customer_id    31423
started_at         0
ended_at        4432
source             0
device             0
dtype: int64

In [123]:
ws_df.duplicated().sum()

np.int64(0)

In [124]:
ws_df.nunique()

session_id     90000
customer_id     1500
started_at     89938
ended_at       85498
source             5
device             3
dtype: int64

In [125]:
ws_df["source"].unique()

array(['ads', 'direct', 'email', 'referral', 'social'], dtype=object)

In [126]:
ws_df["device"].unique()

array(['desktop', 'mobile', 'tablet'], dtype=object)

In [127]:
def build_dim_source(web_session_df: pd.DataFrame) -> pd.DataFrame:
    dim_source = pd.DataFrame()
    dim_source["name"] = web_session_df["source"].unique()
    dim_source["source_id"] = dim_source.index + 1
    dim_source = dim_source[["source_id","name"]]
    return dim_source

dim_source = build_dim_source(ws_df)

In [128]:
def build_dim_device(web_session_df: pd.DataFrame) -> pd.DataFrame:
    dim_device = pd.DataFrame()
    dim_device["name"] = web_session_df["device"].unique()
    dim_device["device_id"] = dim_device.index + 1
    dim_device = dim_device[["device_id","name"]]
    return dim_device

dim_device = build_dim_device(ws_df)

In [129]:
ws_df["started_at"] = pd.to_datetime(ws_df["started_at"]).dt.floor('min')
ws_df["ended_at"] = pd.to_datetime(ws_df["ended_at"]).dt.floor('min')
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop
1,11000000001,332.0,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop
2,11000000002,NaN,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile
3,11000000003,771.0,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile
4,11000000004,908.0,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile

In [130]:
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop
1,11000000001,332.0,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop
2,11000000002,NaN,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile
3,11000000003,771.0,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile
4,11000000004,908.0,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile

In [12]:
import pandas as pd
shipment = pd.read_csv("../../data/raw/shipment.csv")
sales_order = pd.read_csv("../../data/raw/sales_order.csv")
sales_order.head()

,order_id,customer_id,channel_id,store_id,order_date,billing_address_id,shipping_address_id,status,currency_code,subtotal,tax_amount,shipping_fee,total_amount
0,1000000000,356,1,NaN,2024-11-26 07:50:47,2910.0,1595,FULFILLED,ARS,51600.0,10836.00,1200.0,63636.00
1,1000000001,601,1,NaN,2024-01-31 01:00:04,3803.0,3534,CREATED,ARS,63840.0,13406.40,900.0,78146.40
2,1000000002,1234,1,NaN,2025-02-26 19:39:44,1126.0,4063,FULFILLED,ARS,25260.0,5304.60,1500.0,32064.60
3,1000000003,156,1,NaN,2025-03-01 17:35:36,3665.0,1507,FULFILLED,ARS,25500.0,5355.00,0.0,30855.00
4,1000000004,616,2,4.0,2024-03-30 02:46:36,1293.0,4,FULFILLED,ARS,44175.0,9276.75,0.0,53451.75

In [13]:
shipment.head()

,shipment_id,order_id,carrier,tracking_number,status,shipped_at,delivered_at
0,9000000000,1000000000,Correo Argentino,TRK-LM6S0ZIUQ6,DELIVERED,2024-11-27 07:50:47,2024-11-30 07:50:47
1,9000000001,1000000001,Correo Argentino,TRK-S7JYRIGG48,READY,2024-02-01 01:00:04,2024-02-05 01:00:04
2,9000000002,1000000002,Correo Argentino,TRK-YI8R5NTIPW,DELIVERED,2025-02-27 19:39:44,2025-03-01 19:39:44
3,9000000003,1000000003,Correo Argentino,TRK-UWNN6LXYNU,DELIVERED,2025-03-02 17:35:36,2025-03-06 17:35:36
4,9000000004,1000000004,PICKUP,NaN,DELIVERED,2024-03-30 02:46:36,2024-03-31 02:46:36

In [3]:
shipment.isnull().sum()

shipment_id           0
order_id              0
carrier               0
tracking_number    5340
status                0
shipped_at          957
delivered_at        957
dtype: int64

In [16]:
payment = pd.read_csv("../../data/raw/payment.csv")
payment.isnull().sum()

payment_id            0
order_id              0
method                0
status                0
amount                0
paid_at            1199
transaction_ref    1199
dtype: int64

In [11]:
pd.to_datetime(shipment['shipped_at']).dt.strftime('%Y%m%d%H%M')#.astype(int)

0        202411270750
1        202402010100
2        202502271939
3        202503021735
4        202403300246
             ...
11995    202506111412
11996    202409040319
11997    202505050403
11998    202507200647
11999    202508210705
Name: shipped_at, Length: 12000, dtype: object

In [4]:
shipment.duplicated().sum()

np.int64(0)

In [2]:
import pandas as pd
sales_order = pd.read_csv('../../data/raw/sales_order.csv')
sales_order['total_amount'].mean()

np.float64(42497.8341925)

In [14]:
sales_order.columns

Index(['order_id', 'customer_id', 'channel_id', 'store_id', 'order_date',
       'billing_address_id', 'shipping_address_id', 'status', 'currency_code',
       'subtotal', 'tax_amount', 'shipping_fee', 'total_amount'],
      dtype='object')

In [18]:
sales_order['total_amount'].sum()

np.float64(509974010.31)

In [7]:
web_session = pd.read_csv('../../data/raw/web_session.csv')
web_session['customer_id'].nunique()

1500

In [13]:
nps_response = pd.read_csv('../../data/raw/nps_response.csv')
nps_response['score'].mean()

np.float64(7.070208023774145)

In [24]:
dim_address = pd.read_csv('../../data/warehouse/dim_address.csv')
so_province = sales_order.merge(dim_address[['address_id','province']], left_on='shipping_address_id', right_on='address_id', how='left')
so_province['province'].value_counts(normalize=True)

province
Buenos Aires    0.430500
Córdoba         0.230417
Santa Fe        0.179417
Mendoza         0.159667
Name: proportion, dtype: float64

In [27]:
so_province.groupby('province')['total_amount'].sum().div(so_province['total_amount'].sum())#.value_counts(normalize=True)

province
Buenos Aires    0.433326
Córdoba         0.226586
Mendoza         0.159134
Santa Fe        0.180953
Name: total_amount, dtype: float64

In [28]:
so_province.head()

,order_id,customer_id,channel_id,store_id,order_date,billing_address_id,shipping_address_id,status,currency_code,subtotal,tax_amount,shipping_fee,total_amount,address_id,province
0,1000000000,356,1,NaN,2024-11-26 07:50:47,2910.0,1595,FULFILLED,ARS,51600.0,10836.00,1200.0,63636.00,1595,Buenos Aires
1,1000000001,601,1,NaN,2024-01-31 01:00:04,3803.0,3534,CREATED,ARS,63840.0,13406.40,900.0,78146.40,3534,Buenos Aires
2,1000000002,1234,1,NaN,2025-02-26 19:39:44,1126.0,4063,FULFILLED,ARS,25260.0,5304.60,1500.0,32064.60,4063,Buenos Aires
3,1000000003,156,1,NaN,2025-03-01 17:35:36,3665.0,1507,FULFILLED,ARS,25500.0,5355.00,0.0,30855.00,1507,Buenos Aires
4,1000000004,616,2,4.0,2024-03-30 02:46:36,1293.0,4,FULFILLED,ARS,44175.0,9276.75,0.0,53451.75,4,Mendoza

In [5]:
shipment.nunique()

shipment_id        12000
order_id           12000
carrier                2
tracking_number     6660
status                 4
shipped_at         11041
delivered_at       11040
dtype: int64

In [131]:
def build_dim_calendar(ws_df: pd.DataFrame) -> pd.DataFrame:

    start_date = ws_df["started_at"].min()
    end_date = ws_df["ended_at"].max()
    date_range = pd.date_range(start=start_date, end=end_date, freq="max")

    dim_time = pd.DataFrame({
        "calendar_key": range(1, len(date_range) + 1),
        "calendar_id": date_range.strftime("%Y%m%d%H%M").astype(int),
        "date": date_range.date,
        "time": date_range.time,
        "year": date_range.year,
        "month": date_range.month,
        "month_name": date_range.strftime("%B"),
        "day": date_range.day,
        "day_of_week": date_range.dayofweek + 1,
        "day_name": date_range.strftime("%A"),
        "hour": date_range.hour,
        "maxute": date_range.minute,
        "is_weekend": date_range.dayofweek >= 5
    })
    
    return dim_time

dim_calendar = build_dim_calendar(ws_df)
dim_calendar.head()

,calendar_key,calendar_id,date,time,year,month,month_name,day,day_of_week,day_name,hour,minute,is_weekend
0,1,202401010001,2024-01-01,00:01:00,2024,1,January,1,1,Monday,0,1,False
1,2,202401010002,2024-01-01,00:02:00,2024,1,January,1,1,Monday,0,2,False
2,3,202401010003,2024-01-01,00:03:00,2024,1,January,1,1,Monday,0,3,False
3,4,202401010004,2024-01-01,00:04:00,2024,1,January,1,1,Monday,0,4,False
4,5,202401010005,2024-01-01,00:05:00,2024,1,January,1,1,Monday,0,5,False

In [132]:
customer_df = pd.read_csv("../../data/raw/customer.csv")
customer_df.head()

,customer_id,email,first_name,last_name,phone,status,created_at
0,1,maría.gonzález.1@example.com,María,González,+54 9 11 4657-3286,A,2025-03-31 23:30:11
1,2,maría.silva.2@example.com,María,Silva,+54 9 11 1520-1488,A,2023-11-09 12:39:26
2,3,juan.pérez.3@example.com,Juan,Pérez,+54 9 11 1434-4257,A,2024-03-01 17:06:48
3,4,lucas.ruiz.4@example.com,Lucas,Ruiz,+54 9 11 5557-1106,A,2024-02-21 05:18:39
4,5,mateo.ruiz.5@example.com,Mateo,Ruiz,+54 9 11 4527-6514,A,2024-05-24 06:43:45

In [133]:
customer_df.isnull().sum()

customer_id    0
email          0
first_name     0
last_name      0
phone          0
status         0
created_at     0
dtype: int64

In [134]:
customer_df.duplicated().sum()

np.int64(0)

In [135]:
customer_df.nunique()

customer_id    1500
email          1500
first_name       20
last_name        20
phone          1500
status            2
created_at     1500
dtype: int64

In [136]:
source_map = dim_source.set_index("name").to_dict()["source_id"]
ws_df["source_id"] = ws_df["source"].map(source_map)
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device,source_id
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop,1
1,11000000001,332.0,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop,2
2,11000000002,NaN,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile,3
3,11000000003,771.0,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile,1
4,11000000004,908.0,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile,2

In [137]:
device_map = dim_device.set_index("name")["device_id"].to_dict()
ws_df["device_id"] = ws_df["device"].map(device_map)
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device,source_id,device_id
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop,1,1
1,11000000001,332.0,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop,2,1
2,11000000002,NaN,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile,3,2
3,11000000003,771.0,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile,1,2
4,11000000004,908.0,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile,2,2

In [138]:
customer_df[customer_df["customer_id"]==0]

Empty DataFrame
Columns: [customer_id, email, first_name, last_name, phone, status, created_at]
Index: []

In [144]:
ws_df[ws_df["started_at"].isnull()]

Empty DataFrame
Columns: [session_id, customer_id, started_at, ended_at, source, device, source_id, device_id, started_at_int, ended_at_int, started_at_id, ended_at_id]
Index: []

In [158]:
ws_df["started_at_int"] = ws_df["started_at"].dt.strftime("%Y%m%d%H%M").astype(int)
ws_df["ended_at_int"] = ws_df["ended_at"].fillna('1900-01-01 00:00:00')
ws_df["ended_at_int"] = ws_df["ended_at_int"].dt.strftime("%Y%m%d%H%M").astype(int)
ws_df["ended_at_int"] = ws_df["ended_at_int"].replace(190001010000, 0)
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device,source_id,device_id,started_at_int,ended_at_int,started_at_id,ended_at_id
0,11000000000,791,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop,1,1,202402021554,202402021605,47034,47045.0
1,11000000001,332,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop,2,1,202507261149,202507261157,824389,824397.0
2,11000000002,0,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile,3,2,202406040304,202406040306,223384,223386.0
3,11000000003,771,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile,1,2,202403241550,202403241630,120470,120510.0
4,11000000004,908,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile,2,2,202408221647,202408221700,337967,337980.0

In [161]:
def build_fact_web_session(web_session_clean, dim_device, dim_source, dim_calendar, dim_customer):
    
    device_map = dim_device.set_index("name")["device_id"].to_dict()
    web_session_clean["device_id"] = web_session_clean["device"].map(device_map)

    source_map = dim_source.set_index("name")["source_id"].to_dict()
    web_session_clean["source_id"] = web_session_clean["source"].map(source_map)

    web_session_clean["customer_id"] = web_session_clean["customer_id"].fillna(0).astype(int)
    # Crear customer Anonimo con customer_id 0

    calendar_map = dim_calendar.set_index("calendar_id")["calendar_key"].to_dict()
    web_session_clean["started_at_id"] = web_session_clean["started_at_int"].map(calendar_map)
    web_session_clean["ended_at_id"] = web_session_clean["ended_at_int"].map(calendar_map)

    fact_web_session = (
        web_session_clean[
            [
                "session_id",
                "customer_id",
                "started_at_id",
                "ended_at_id",
                "source_id",
                "device_id"
            ]
        ]
    )
    return fact_web_session

fact_web_session = build_fact_web_session(ws_df, dim_device, dim_source, dim_calendar, customer_df)
fact_web_session.head()

    session_id  customer_id  started_at_id  ended_at_id  source_id  device_id
0  11000000000          791          47034      47045.0          1          1
1  11000000001          332         824389     824397.0          2          1
2  11000000002            0         223384     223386.0          3          2
3  11000000003          771         120470     120510.0          1          2
4  11000000004          908         337967     337980.0          2          2

In [162]:
fact_web_session.isnull().sum()

session_id          0
customer_id         0
started_at_id       0
ended_at_id      4432
source_id           0
device_id           0
dtype: int64

In [163]:
ws_df.isnull().sum()

session_id           0
customer_id          0
started_at           0
ended_at          4432
source               0
device               0
source_id            0
device_id            0
started_at_int       0
ended_at_int         0
started_at_id        0
ended_at_id       4432
dtype: int64

In [116]:
ws_df.head()

,session_id,customer_id,started_at,ended_at,source,device,source_id,device_id,started_at_new,started_at_int,ended_at_int
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop,1,1,2024-02-02 15:54:00,2.024020e+11,2.024020e+11
1,11000000001,332.0,2025-07-26 11:49:00,2025-07-26 11:57:00,direct,desktop,2,1,2025-07-26 11:49:20,2.025073e+11,2.025073e+11
2,11000000002,NaN,2024-06-04 03:04:00,2024-06-04 03:06:00,email,mobile,3,2,2024-06-04 03:04:56,2.024060e+11,2.024060e+11
3,11000000003,771.0,2024-03-24 15:50:00,2024-03-24 16:30:00,ads,mobile,1,2,2024-03-24 15:50:13,2.024032e+11,2.024032e+11
4,11000000004,908.0,2024-08-22 16:47:00,2024-08-22 17:00:00,direct,mobile,2,2,2024-08-22 16:47:04,2.024082e+11,2.024082e+11

In [104]:
dim_calendar.head()

,calendar_key,calendar_id,date,time,year,month,month_name,day,day_of_week,day_name,hour,minute,is_weekend
0,1,202401010001,2024-01-01,00:01:00,2024,1,January,1,1,Monday,0,1,False
1,2,202401010002,2024-01-01,00:02:00,2024,1,January,1,1,Monday,0,2,False
2,3,202401010003,2024-01-01,00:03:00,2024,1,January,1,1,Monday,0,3,False
3,4,202401010004,2024-01-01,00:04:00,2024,1,January,1,1,Monday,0,4,False
4,5,202401010005,2024-01-01,00:05:00,2024,1,January,1,1,Monday,0,5,False

In [20]:
import pandas as pd
clean_customer = pd.read_csv("../../data/staging/clean_customer.csv") # created_at
nps_response = pd.read_csv("../../data/raw/nps_response.csv") # responded_at
shipment = pd.read_csv("../../data/raw/shipment.csv") # shipped_at, delivered_at
product = pd.read_csv("../../data/raw/product.csv") # created_at
web_session = pd.read_csv("../../data/raw/web_session.csv") # started_at, ended_at
dim_address = pd.read_csv("../../data/warehouse/dim_address.csv") # started_at, ended_at
sales_order = pd.read_csv("../../data/raw/sales_order.csv") # order_date
payment = pd.read_csv("../../data/raw/payment.csv") # paid_at
address = pd.read_csv("../../data/raw/address.csv") # created_at
product_category = pd.read_csv("../../data/raw/product_category.csv")
channel = pd.read_csv("../../data/raw/channel.csv")
dim_calendar = pd.read_parquet("../../data/warehouse/dim_calendar.parquet")

In [7]:
import pandas as pd
payment = pd.read_csv("../../data/raw/payment.csv")
payment.head()

,payment_id,order_id,method,status,amount,paid_at,transaction_ref
0,7000000000,1000000000,CARD,PAID,63636.00,2024-11-27 00:50:47,TX-1HW3GM7Q6LFJ
1,7000000001,1000000001,GATEWAY,PENDING,78146.40,NaN,NaN
2,7000000002,1000000002,CARD,PAID,32064.60,2025-02-28 07:39:44,TX-8PBOWVHD7B4I
3,7000000003,1000000003,CARD,PAID,30855.00,2025-03-02 15:35:36,TX-SQ97NPWQ6YK8
4,7000000004,1000000004,CARD,PAID,53451.75,2024-04-01 01:46:36,TX-F7761XS1CXDC

In [17]:
payment[payment.method=="GATEWAY"]#.isnull().sum()

,payment_id,order_id,method,status,amount,paid_at,transaction_ref
1,7000000001,1000000001,GATEWAY,PENDING,78146.40,NaN,NaN
9,7000000009,1000000009,GATEWAY,PAID,16718.25,2024-03-31 18:34:46,TX-J2VP8C6ROCZQ
16,7000000016,1000000016,GATEWAY,PAID,28642.80,2025-08-29 20:46:32,TX-Y2BIADVO9F18
18,7000000018,1000000018,GATEWAY,FAILED,100107.90,NaN,NaN
42,7000000042,1000000042,GATEWAY,PAID,13914.60,2024-09-28 02:17:36,TX-X79V37PRDDTB
...,...,...,...,...,...,...,...
11974,7000011974,1000011974,GATEWAY,PAID,31692.00,2025-04-26 04:45:38,TX-DWV3HVMBGGMP
11988,7000011988,1000011988,GATEWAY,FAILED,65354.28,NaN,NaN
11992,7000011992,1000011992,GATEWAY,PAID,49116.00,2025-02-23 09:30:08,TX-YM2XVVUTYTUD
11993,7000011993,1000011993,GATEWAY,PAID,60831.30,2024-09-29 07:23:36,TX-6ZJV32UV47AY
11996,7000011996,1000011996,GATEWAY,PAID,25613.28,2024-09-03 17:19:45,TX-I2U3PQQ9S5JG

In [11]:
sales_order = pd.read_csv("../../data/raw/sales_order.csv")
sales_order.shape
# payment.status.unique()

(12000, 13)

In [8]:
payment.nunique()

payment_id         12000
order_id           12000
method                 4
status                 4
amount              2686
paid_at            10800
transaction_ref    10801
dtype: int64

In [3]:
shipment.status.unique()

array(['DELIVERED', 'READY', 'SHIPPED', 'CANCELLED'], dtype=object)

In [13]:
fact_web_session = pd.read_csv("../../data/warehouse/fact_web_session.csv")
web_session_clean = pd.read_csv("../../data/staging/clean_web_session.csv")
web_session_clean.isnull().sum()

session_id        0
customer_id       0
started_at        0
ended_at          0
source            0
device            0
started_at_int    0
ended_at_int      0
duration_sec      0
dtype: int64

In [2]:
web_session.isnull().sum()

session_id         0
customer_id    31423
started_at         0
ended_at        4432
source             0
device             0
dtype: int64

In [6]:
sales_order_item = pd.read_csv('../../data/raw/sales_order_item.csv')
sales_order = pd.read_csv('../../data/raw/sales_order.csv')
sales_order['order_date'] = pd.to_datetime(sales_order['order_date']).dt.floor('min')
sales_order_item.head()#.isnull().sum()

,order_item_id,order_id,product_id,quantity,unit_price,discount_amount,line_total
0,5000000000,1000000000,2,2,15000.0,0.0,30000.0
1,5000000001,1000000000,1,2,12000.0,2400.0,21600.0
2,5000000002,1000000001,1,1,12000.0,240.0,11760.0
3,5000000003,1000000001,2,2,15000.0,600.0,29400.0
4,5000000004,1000000001,1,2,12600.0,2520.0,22680.0

In [49]:
fact_sales_order_item = (
    sales_order_item
    .merge(sales_order, on='order_id', how='inner')
    .drop(columns=['subtotal'])
)

fact_sales_order_item = (
    fact_sales_order_item[[
        'order_item_id',
        'order_id',
        'product_id',
        'customer_id',
        'channel_id',
        'store_id',
        'billing_address_id',
        'shipping_address_id',
        'order_date',
        'quantity',
        'unit_price',
        'discount_amount',
        'line_total',
        'status',
        'currency_code',
        'tax_amount',
        'shipping_fee'
    ]]
    .copy()
)

Index(['order_item_id', 'order_id', 'product_id', 'quantity', 'unit_price',
       'discount_amount', 'line_total', 'customer_id', 'channel_id',
       'store_id', 'order_date', 'billing_address_id', 'shipping_address_id',
       'status', 'currency_code', 'subtotal', 'tax_amount', 'shipping_fee',
       'total_amount'],
      dtype='object')

In [2]:
import pandas as pd
address = pd.read_csv('../../data/raw/address.csv')
address = address.drop(columns=['created_at'])
address.to_csv('../../data/raw/address.csv')

In [ ]:
import pandas as pd

def build_fact_sales_order_item(
        sales_order_item_clean: pd.DataFrame,
        sales_order_clean: pd.DataFrame,
        dim_channel: pd.DataFrame,
        dim_product: pd.DataFrame,
        dim_customer: pd.DataFrame,
        dim_address: pd.DataFrame,
        dim_store: pd.DataFrame,
        dim_calendar: pd.DataFrame
    ) -> pd.DataFrame:
    '''
    DESCRIPTION
    '''

    fact_sales_order_item = (
        sales_order_item_clean
        .merge(sales_order_clean, on='order_id', how='inner')
        .drop(columns=['subtotal'])
    )

    fact_sales_order_item = (
        fact_sales_order_item
        .merge(dim_channel[['channel_sk','channel_id']], on='channel_id', how='left')
        .merge(dim_product[['product_sk','product_id']], on='product_id', how='left')
        .merge(dim_customer[['customer_sk','customer_id']], on='customer_id', how='left')
        .merge(dim_address[['address_sk','address_id']], left_on='billing_address_id', right_on='address_id', how='left')
        .merge(dim_address[['address_sk','address_id']], left_on='shipping_address_id', right_on='address_id', how='left', suffixes=['','_shipping'])
        .merge(dim_store[['store_sk','store_id']], on='store_id', how='left')
        .merge(dim_calendar[['time_sk','datetime_id']], left_on='order_date_int', right_on='datetime_id', how='left')
        .drop(columns=['channel_id','product_id','customer_id','address_id','address_id_shipping','store_id','order_date_int','order_date','datetime_id'])
        .rename(columns={'time_sk':'order_date_sk','address_sk':'billing_address_sk','address_sk_shipping':'shipping_address_sk'})
    )

    fact_sales_order_item = fact_sales_order_item.reset_index(drop=True)
    fact_sales_order_item['order_item_sk'] = fact_sales_order_item.index + 1

    fact_sales_order_item = (
        fact_sales_order_item[[
            'order_item_sk',
            'order_item_id',
            'order_id',
            'product_sk',
            'customer_sk',
            'channel_sk',
            'store_sk',
            'billing_address_sk',
            'shipping_address_sk',
            'order_date_sk',
            'quantity',
            'unit_price',
            'discount_amount',
            'line_total',
            'status',
            'currency_code',
            'tax_amount',
            'shipping_fee'
        ]]
        .copy()
    )

    return fact_sales_order_item

In [43]:
sales_order.shape

(12000, 13)

In [39]:
sales_order.isnull().sum()

order_id                  0
customer_id               0
channel_id                0
store_id               7242
order_date                0
billing_address_id     1195
shipping_address_id       0
status                    0
currency_code             0
subtotal                  0
tax_amount                0
shipping_fee              0
total_amount              0
dtype: int64

In [42]:
sales_order.nunique()

order_id               12000
customer_id             1499
channel_id                 2
store_id                   4
order_date             11996
billing_address_id      3087
shipping_address_id     2867
status                     5
currency_code              1
subtotal                1627
tax_amount              1627
shipping_fee               4
total_amount            2686
dtype: int64

In [ ]:
['order_item_id',
 'order_id',
 'product_id',
 'customer_id',
 'channel_id',
 'store_id',
 'order_date',
 'shipping_address_id',
 'billing_address_id',
 'status',
 'quantity',
 'unit_price',
 'discount_amount',
 'line_total',
 'currency_code',
 'tax_amount',
 'shipping_fee']

In [37]:
sales_order_item.head()

,order_item_id,order_id,product_id,quantity,unit_price,discount_amount,line_total
0,5000000000,1000000000,2,2,15000.0,0.0,30000.0
1,5000000001,1000000000,1,2,12000.0,2400.0,21600.0
2,5000000002,1000000001,1,1,12000.0,240.0,11760.0
3,5000000003,1000000001,2,2,15000.0,600.0,29400.0
4,5000000004,1000000001,1,2,12600.0,2520.0,22680.0

In [25]:
import pandas as pd
store = pd.read_csv("../../data/raw/store.csv")
address = pd.read_csv("../../data/raw/address.csv")
province = pd.read_csv("../../data/raw/province.csv")

In [22]:
address.merge(province,on='province_id').columns.to_list()

['address_id',
 'line1',
 'line2',
 'city',
 'province_id',
 'postal_code',
 'country_code',
 'created_at',
 'name',
 'code']

In [28]:
dim_store = (
    store
    .merge(address, on='address_id', how='inner')
    .merge(province, on='province_id', how='inner', suffixes=['','_province'])
    .drop(columns=['address_id','province_id'])
    .rename(columns={'name_province':'province','code':'province_code'}))
dim_store = dim_store.reset_index(drop=True)
dim_store['store_sk'] = dim_store.index + 1

dim_store = (
    dim_store[[
        'store_sk',
        'store_id',
        'name',
        'line1',
        'line2',
        'country_code',
        'province',
        'province_code',
        'city',
        'postal_code',
        'created_at'
    ]]
    .copy()
)

dim_store

,store_sk,store_id,name,line1,line2,country_code,province,province_code,city,postal_code,created_at
0,1,1,Tienda BA,Sucursal Buenos Aires - Av. Principal 101,NaN,AR,Buenos Aires,BA,Buenos Aires,1001,2023-12-13 10:49:04
1,2,2,Tienda CBA,Sucursal Córdoba - Av. Principal 102,NaN,AR,Córdoba,CBA,Córdoba,1002,2023-11-13 13:09:24
2,3,3,Tienda SF,Sucursal Santa Fe - Av. Principal 103,NaN,AR,Santa Fe,SF,Santa Fe,1003,2023-07-31 15:36:04
3,4,4,Tienda MZA,Sucursal Mendoza - Av. Principal 104,NaN,AR,Mendoza,MZA,Mendoza,1004,2023-09-16 13:54:28

In [ ]:
dim_store = (
    store
    .merge(address, on='address_id', how='inner')
    .merge(province, on='province_id', how='inner', suffixes=['','_province'])
    .drop(columns=['address_id','province_id'])
    .rename(columns={'name_province':'province','code':'province_code'}))
dim_store = dim_store.reset_index(drop=True)
dim_store['store_sk'] = dim_store.index + 1

dim_store = (
    dim_store[[
        'store_sk',
        'store_id',
        'name',
        'line1',
        'line2',
        'country_code',
        'province',
        'province_code',
        'city',
        'postal_code',
        'created_at'
    ]]
    .copy()
)

dim_store = pd.read_csv('../../data/raw/sales_order_item.csv')

In [7]:
fact_table = (
        nps_response
        .merge(customer[['email','customer_id']], on='customer_id', how='left')
        .merge(channel[['code','channel_id']], on='channel_id', how='left')
        .merge(dim_calendar[['time_key','datetime_id']], left_on='responded_at_int', right_on='datetime_id', how='left')
    )
fact_table.head()

,nps_id,customer_id,channel_id,score,comment,responded_at,email,code
0,13000000000,1083,1,10,NaN,2024-06-01 03:07:26,isabella.torres.1083@example.com,ONLINE
1,13000000001,1383,1,5,Volvería a comprar,2024-03-11 13:19:21,mateo.sánchez.1383@example.com,ONLINE
2,13000000002,179,1,10,Atención muy buena,2024-04-11 23:16:07,alex.torres.179@example.com,ONLINE
3,13000000003,566,1,7,Todo perfecto,2024-06-30 17:09:09,camila.fernández.566@example.com,ONLINE
4,13000000004,1004,1,8,Atención muy buena,2025-02-05 02:14:04,franco.rojas.1004@example.com,ONLINE

In [13]:
product_category_clean = (
    product_category
    .merge(product_category[['category_id','name']].add_prefix("parent_"),
            left_on='parent_id',
            right_on='parent_category_id',
            how="left")
    .drop(columns=['parent_id','parent_category_id']))

product_category_clean

   category_id     name parent_name
0            1  Bottles         NaN
1            2  Classic     Bottles
2            3    Sport     Bottles

In [16]:
dim_product = (
    product
    .merge(product_category_clean,
           on='category_id',
           how='left',
           suffixes=['','_category'])
    .rename(columns={'name_category':'category_name',
                     'parent_name':'category_parent_name'})
    .drop(columns=['category_id']))

dim_product = dim_product.reset_index(drop=True)
dim_product['product_sk'] = dim_product.index + 1

dim_product = (
    dim_product[[
        'product_sk',
        'product_id',
        'sku',
        'name',
        'list_price',
        'status',
        'created_at',
        'category_name',
        'category_parent_name'
    ]]
)

,product_id,sku,name,list_price,status,created_at,category_name,category_parent_name,product_sk
0,1,ECO-CLASSIC-A,Classic A Bottle,12000.0,A,2024-01-01 00:00:00,Classic,Bottles,1
1,2,ECO-SPORT-B,Sport B Bottle,15000.0,A,2024-01-01 00:00:00,Sport,Bottles,2

In [19]:
channel = pd.read_csv("../../data/raw/channel.csv")
channel

   channel_id     code             name
0           1   ONLINE    Tienda Online
1           2  OFFLINE  Tiendas Físicas

In [27]:
nps_response.isnull().sum()

nps_id            0
customer_id       0
channel_id        0
score             0
comment         350
responded_at      0
dtype: int64

In [29]:
nps_response['responded_at'] = pd.to_datetime(nps_response['responded_at']).dt.floor('min')
nps_response['responded_at_int'] = nps_response['responded_at'].dt.strftime('%Y%m%d%H%M').astype(int)
nps_response

,nps_id,customer_id,channel_id,score,comment,responded_at,responded_at_int
0,13000000000,1083,1,10,NaN,2024-06-01 03:07:00,202406010307
1,13000000001,1383,1,5,Volvería a comprar,2024-03-11 13:19:00,202403111319
2,13000000002,179,1,10,Atención muy buena,2024-04-11 23:16:00,202404112316
3,13000000003,566,1,7,Todo perfecto,2024-06-30 17:09:00,202406301709
4,13000000004,1004,1,8,Atención muy buena,2025-02-05 02:14:00,202502050214
...,...,...,...,...,...,...,...
2687,13000002687,899,1,4,Entrega rápida y producto excelente,2024-09-24 22:26:00,202409242226
2688,13000002688,806,1,7,Podría mejorar el empaque,2025-01-17 17:04:00,202501171704
2689,13000002689,1464,2,7,Volvería a comprar,2024-02-10 09:45:00,202402100945
2690,13000002690,1105,2,7,NaN,2025-05-14 07:39:00,202505140739
2691,13000002691,847,1,9,Volvería a comprar,2025-02-05 13:24:00,202502051324

In [31]:
dim_calendar = pd.read_parquet('../../data/warehouse/dim_calendar.parquet')
nps_response_fact = (
        nps_response    
        .merge(dim_calendar[['time_key','datetime_id']], left_on='responded_at_int', right_on='datetime_id', how='left')
        .drop(columns=['responded_at','datetime_id','responded_at_int'])
    )
nps_response_fact

,nps_id,customer_id,channel_id,score,comment,time_key
0,13000000000,1083,1,10,NaN,571868
1,13000000001,1383,1,5,Volvería a comprar,454400
2,13000000002,179,1,10,Atención muy buena,499637
3,13000000003,566,1,7,Todo perfecto,614470
4,13000000004,1004,1,8,Atención muy buena,930375
...,...,...,...,...,...,...
2687,13000002687,899,1,4,Entrega rápida y producto excelente,738627
2688,13000002688,806,1,7,Podría mejorar el empaque,903905
2689,13000002689,1464,2,7,Volvería a comprar,410986
2690,13000002690,1105,2,7,NaN,1071820
2691,13000002691,847,1,9,Volvería a comprar,931045

In [4]:
address.province_id.unique()

array([1, 2, 3, 4])

In [16]:
customer_date = customer['created_at'].dropna().min()
nps_response_date = nps_response['responded_at'].dropna().min()
shipment_date = min([shipment['shipped_at'].dropna().min(),shipment['delivered_at'].dropna().min()])
product_date = product['created_at'].dropna().min()
web_session_date = min([web_session['started_at'].dropna().min(),web_session['ended_at'].dropna().min()])
sales_order_date = sales_order['order_date'].dropna().min()
payment_date = payment['paid_at'].dropna().min()
address_date = address['created_at'].dropna().min()
min([customer_date, nps_response_date, shipment_date, product_date, web_session_date, sales_order_date, payment_date, address_date])

'2023-05-06 03:11:24'

In [17]:
customer_date = customer['created_at'].dropna().max()
nps_response_date = nps_response['responded_at'].dropna().max()
shipment_date = max([shipment['shipped_at'].dropna().max(),shipment['delivered_at'].dropna().max()])
product_date = product['created_at'].dropna().max()
web_session_date = max([web_session['started_at'].dropna().max(),web_session['ended_at'].dropna().max()])
sales_order_date = sales_order['order_date'].dropna().max()
payment_date = payment['paid_at'].dropna().max()
address_date = address['created_at'].dropna().max()
max([customer_date, nps_response_date, shipment_date, product_date, web_session_date, sales_order_date, payment_date, address_date])

'2025-10-12 20:26:52'

In [1]:
import pandas as pd

In [2]:
calendar = pd.read_parquet('../../data/warehouse/dim_calendar.parquet')
calendar.head()

,time_key,datetime_id,date,time,year,month,month_name,day,day_of_week,day_name,hour,minute,is_weekend
0,1,202305010000,2023-05-01,00:00:00,2023,5,May,1,1,Monday,0,0,False
1,2,202305010001,2023-05-01,00:01:00,2023,5,May,1,1,Monday,0,1,False
2,3,202305010002,2023-05-01,00:02:00,2023,5,May,1,1,Monday,0,2,False
3,4,202305010003,2023-05-01,00:03:00,2023,5,May,1,1,Monday,0,3,False
4,5,202305010004,2023-05-01,00:04:00,2023,5,May,1,1,Monday,0,4,False

In [62]:
customer

,customer_id,email,first_name,last_name,phone,status,created_at
0,1,maría.gonzález.1@example.com,María,González,+54 9 11 4657-3286,A,2025-03-31 23:30:11
1,2,maría.silva.2@example.com,María,Silva,+54 9 11 1520-1488,A,2023-11-09 12:39:26
2,3,juan.pérez.3@example.com,Juan,Pérez,+54 9 11 1434-4257,A,2024-03-01 17:06:48
3,4,lucas.ruiz.4@example.com,Lucas,Ruiz,+54 9 11 5557-1106,A,2024-02-21 05:18:39
4,5,mateo.ruiz.5@example.com,Mateo,Ruiz,+54 9 11 4527-6514,A,2024-05-24 06:43:45
...,...,...,...,...,...,...,...
1495,1496,alex.garcía.1496@example.com,Alex,García,+54 9 11 2887-3333,A,2024-06-06 23:29:27
1496,1497,benjamín.flores.1497@example.com,Benjamín,Flores,+54 9 11 6896-1719,A,2024-01-31 23:56:34
1497,1498,alex.pérez.1498@example.com,Alex,Pérez,+54 9 11 4587-5292,A,2024-02-03 15:43:30
1498,1499,mateo.romero.1499@example.com,Mateo,Romero,+54 9 11 3925-4211,A,2025-06-22 07:10:56
1499,1500,alex.martínez.1500@example.com,Alex,Martínez,+54 9 11 2657-1343,A,2025-06-18 16:26:54

In [60]:
(pd.to_datetime(web_session['ended_at']) - pd.to_datetime(web_session['started_at'])).dt.total_seconds()

0         660.0
1         480.0
2         120.0
3        2400.0
4         780.0
          ...
89995       NaN
89996    1320.0
89997      60.0
89998     720.0
89999       NaN
Length: 90000, dtype: float64

In [20]:
pd.to_datetime(address['created_at'].dropna()).dt.strftime("%Y%m%d%H%M").astype(int)

0       202312131049
1       202311131309
2       202307311536
3       202309161354
4       202411300512
            ...
3199    202502280127
3200    202504232115
3201    202509231301
3202    202402121719
3203    202505210419
Name: created_at, Length: 3204, dtype: int64

In [57]:
(pd.to_datetime(web_session.ended_at).dt.floor('min') - pd.to_datetime(web_session.started_at).dt.floor('min')).dt.total_seconds()

0         660.0
1         480.0
2         120.0
3        2400.0
4         780.0
          ...
89995       NaN
89996    1320.0
89997      60.0
89998     720.0
89999       NaN
Length: 90000, dtype: float64

In [45]:
web_session['ended_at_int'] = (
        pd.to_datetime(web_session['ended_at'])
        .dt.strftime("%Y%m%d%H%M")
        .fillna(str(DATETIME_UNKNOWN_OBJ))
        .astype(int)
    )

a
b

In [ ]:
web_session.merge(customer.add_prefix('started_at_'), left_on ='customer_id', right_on ='started_at_customer_id', how='left')

In [43]:
web_session.merge(customer, on ='customer_id', how='left')

,session_id,customer_id,started_at,ended_at,source,device,email,first_name,last_name,phone,status,created_at
0,11000000000,791.0,2024-02-02 15:54:00,2024-02-02 16:05:00,ads,desktop,emma.martínez.791@example.com,Emma,Martínez,+54 9 11 1305-5644,I,2024-10-08 06:52:49
1,11000000001,332.0,2025-07-26 11:49:20,2025-07-26 11:57:20,direct,desktop,santiago.torres.332@example.com,Santiago,Torres,+54 9 11 1838-4189,A,2024-06-13 05:34:00
2,11000000002,NaN,2024-06-04 03:04:56,2024-06-04 03:06:56,email,mobile,NaN,NaN,NaN,NaN,NaN,NaN
3,11000000003,771.0,2024-03-24 15:50:13,2024-03-24 16:30:13,ads,mobile,alex.medina.771@example.com,Alex,Medina,+54 9 11 7637-4485,A,2025-01-05 14:22:16
4,11000000004,908.0,2024-08-22 16:47:04,2024-08-22 17:00:04,direct,mobile,franco.rojas.908@example.com,Franco,Rojas,+54 9 11 4616-2161,A,2024-03-19 19:02:24
...,...,...,...,...,...,...,...,...,...,...,...,...
89995,11000089995,367.0,2024-03-20 23:24:02,NaN,direct,mobile,martina.díaz.367@example.com,Martina,Díaz,+54 9 11 6523-5833,A,2025-03-14 03:38:27
89996,11000089996,NaN,2025-07-26 03:39:48,2025-07-26 04:01:48,direct,desktop,NaN,NaN,NaN,NaN,NaN,NaN
89997,11000089997,NaN,2024-01-08 01:05:31,2024-01-08 01:06:31,ads,mobile,NaN,NaN,NaN,NaN,NaN,NaN
89998,11000089998,540.0,2025-07-23 13:29:41,2025-07-23 13:41:41,ads,desktop,camila.gómez.540@example.com,Camila,Gómez,+54 9 11 6241-5444,A,2024-07-22 07:35:07
89999,11000089999,406.0,2025-05-10 01:42:32,NaN,direct,mobile,valentina.rojas.406@example.com,Valentina,Rojas,+54 9 11 4555-8854,A,2025-03-18 14:01:41